avigilon-login.yaml

id: Avigilon Default Login

info:
  name: avigilon-default-login
  author: Nate - UVC
  severity: High
  tags: boh

requests:
  - raw:
      - |
        POST /onvif/device_service HTTP/1.1
        Host: {{Hostname}}
        Cookie: auth-token=null
        
        <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ns1="http://www.onvif.org/ver10/device/wsdl"><soap:Body><ns1:GetDeviceInformation></ns1:GetDeviceInformation></soap:Body></soap:Envelope>
    
    digest-username: administrator
    digest-password: ""

    matchers-condition: and
    matchers:
      - type: status
        status:
          - 200


